{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "nb_filter": 24, "input_dtype": "float32", "nb_row": 5, "border_mode": "valid", "nb_col": 5, "dim_ordering": "tf", "activation": "relu", "W_constraint": null, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "b_constraint": null, "batch_input_shape": [null, 64, 200, 3], "subsample": [2, 2], "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "nb_filter": 36, "subsample": [2, 2], "nb_row": 5, "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "bias": true, "nb_col": 5, "activity_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activation": "relu", "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "nb_filter": 48, "subsample": [2, 2], "nb_row": 5, "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "bias": true, "nb_col": 5, "activity_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activation": "relu", "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "nb_filter": 64, "subsample": [1, 1], "nb_row": 3, "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "bias": true, "nb_col": 3, "activity_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activation": "relu", "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "nb_filter": 64, "subsample": [1, 1], "nb_row": 3, "border_mode": "valid", "b_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "bias": true, "nb_col": 3, "activity_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activation": "relu", "trainable": true, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 100, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}, "W_constraint": null, "b_regularizer": null, "bias": true, "input_dim": 1152, "b_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 50, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}, "W_constraint": null, "b_regularizer": null, "bias": true, "input_dim": 100, "b_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 10, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}, "W_constraint": null, "b_regularizer": null, "bias": true, "input_dim": 50, "b_constraint": null, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 1, "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 9.999999747378752e-06}, "W_constraint": null, "b_regularizer": null, "bias": true, "input_dim": 10, "b_constraint": null, "trainable": true}}]}