{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "name": "lambda_1", "output_shape": null, "trainable": true, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00df\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 64, 200, 3], "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "subsample": [2, 2], "nb_col": 5, "trainable": true, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 24, "bias": true, "name": "convolution2d_1", "border_mode": "valid", "b_constraint": null, "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "subsample": [2, 2], "nb_col": 5, "trainable": true, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 36, "bias": true, "name": "convolution2d_2", "border_mode": "valid", "b_constraint": null, "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "subsample": [2, 2], "nb_col": 5, "trainable": true, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 48, "bias": true, "name": "convolution2d_3", "border_mode": "valid", "b_constraint": null, "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "subsample": [1, 1], "nb_col": 3, "trainable": true, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 64, "bias": true, "name": "convolution2d_4", "border_mode": "valid", "b_constraint": null, "nb_row": 3}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "subsample": [1, 1], "nb_col": 3, "trainable": true, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 64, "bias": true, "name": "convolution2d_5", "border_mode": "valid", "b_constraint": null, "nb_row": 3}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 100, "activation": "relu", "name": "dense_1", "trainable": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "input_dim": 1152, "b_constraint": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"output_dim": 50, "activation": "relu", "name": "dense_2", "trainable": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "input_dim": 100, "b_constraint": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"output_dim": 10, "activation": "relu", "name": "dense_3", "trainable": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "input_dim": 50, "b_constraint": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"output_dim": 1, "activation": "linear", "name": "dense_4", "trainable": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "input_dim": 10, "b_constraint": null, "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}}}]}