{"config": [{"config": {"subsample": [2, 2], "trainable": true, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_constraint": null, "input_dtype": "float32", "nb_col": 5, "nb_row": 5, "dim_ordering": "tf", "b_constraint": null, "nb_filter": 24, "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-06, "name": "L1L2Regularizer"}, "batch_input_shape": [null, 64, 200, 3], "name": "convolution2d_1", "border_mode": "valid", "activation": "tanh", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"subsample": [2, 2], "trainable": true, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_constraint": null, "nb_col": 5, "nb_row": 5, "dim_ordering": "tf", "b_constraint": null, "nb_filter": 36, "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-06, "name": "L1L2Regularizer"}, "name": "convolution2d_2", "border_mode": "valid", "activation": "tanh", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"subsample": [2, 2], "trainable": true, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_constraint": null, "nb_col": 5, "nb_row": 5, "dim_ordering": "tf", "b_constraint": null, "nb_filter": 48, "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-06, "name": "L1L2Regularizer"}, "name": "convolution2d_3", "border_mode": "valid", "activation": "tanh", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"subsample": [1, 1], "trainable": true, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_constraint": null, "nb_col": 3, "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "nb_filter": 64, "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-06, "name": "L1L2Regularizer"}, "name": "convolution2d_4", "border_mode": "valid", "activation": "tanh", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"subsample": [1, 1], "trainable": true, "init": "glorot_uniform", "bias": true, "activity_regularizer": null, "W_constraint": null, "nb_col": 3, "nb_row": 3, "dim_ordering": "tf", "b_constraint": null, "nb_filter": 64, "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-06, "name": "L1L2Regularizer"}, "name": "convolution2d_5", "border_mode": "valid", "activation": "tanh", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "output_dim": 100, "bias": true, "activity_regularizer": null, "name": "dense_1", "W_constraint": null, "input_dim": 1152, "b_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-06, "name": "L1L2Regularizer"}, "trainable": true, "activation": "tanh", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "output_dim": 50, "bias": true, "activity_regularizer": null, "name": "dense_2", "W_constraint": null, "input_dim": 100, "b_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-06, "name": "L1L2Regularizer"}, "trainable": true, "activation": "tanh", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "output_dim": 10, "bias": true, "activity_regularizer": null, "name": "dense_3", "W_constraint": null, "input_dim": 50, "b_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-06, "name": "L1L2Regularizer"}, "trainable": true, "activation": "tanh", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "output_dim": 1, "bias": true, "activity_regularizer": null, "name": "dense_4", "W_constraint": null, "input_dim": 10, "b_constraint": null, "W_regularizer": {"l1": 0.0, "l2": 9.999999747378752e-06, "name": "L1L2Regularizer"}, "trainable": true, "activation": "linear", "b_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}